Tekla.Structures.AnalysisInternal.AnalysisChangeManagement
The analysis model change management.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectPositionStart
Start position of object.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectPositionEndOfBeamOfTwoPoints
End position of beam with two points.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectPositionFirstSegment
First segment position.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectPositionNone
Position none.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.#ctor(System.String)
Initializes a new instance of the Tekla.Structures.AnalysisInternal.AnalysisChangeManagement class.
analysisModelName: The analysis model name.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.AnalysisModelName
Gets the analysis model name.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.Enabled
Gets or sets a value indicating whether change management is enabled for the analysis model.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.CreateData
Create new change management data according to the current model situation.
Returns: The new change management time, null if creation fails.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.GetTimes
Get change management data times.
Returns: Change management times.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.GetLastTime
Get the latest change management data time.
Returns: The latest change management time.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.GetObjectTimes(Tekla.Structures.Identifier)
Get object change management data times.
partId: The physical part identifier.
Returns: The object change management data times.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.GetPartsOnlyInPhysical(System.Int32)
Get parts which exist in the physical model but not in the analysis model.
timeId: The time identifier.
If non-zero, only the physical parts which have been created after the time are returned.
Returns: The parts which exist in the physical model but not in the analysis model.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.GetPartsOnlyInAnalysis
Get parts which exist in the analysis model but not in the physical model.
Returns: The parts which exist in the analysis model but not in the physical model.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.LinkAnalysisPartToPhysicalPart(System.Collections.Generic.Dictionary{Tekla.Structures.Identifier,Tekla.Structures.Identifier})
Link analysis parts to physical parts.
analysisPartIdsToPhysical: The mapping analysis part identifier - physical part identifier.
Returns: True if successful.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.GetPartData(Tekla.Structures.Identifier,System.Int32)
Get part change management data.
partId: The physical part identifier.
timeId: The time identifier.
Returns: The part change management data.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.UpdatePartLastData(Tekla.Structures.Identifier)
Update part data of the latest change management data according
to the current model situation.
partId: The physical part identifier.
Returns: True if successful.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.GetPartsDiffering(System.Int32,System.Int32)
Get identifiers of parts with differences data.
timeId: The time identifier.
comparisonTimeId: The comparison time identifier (differences after this). Can be zero.
Returns: The identifiers of parts with differences data.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.GetPartDifferences(Tekla.Structures.Identifier,System.Int32,System.Int32)
Get part differences data.
partId: The physical part identifier.
timeId: The time identifier.
comparisonTimeId: The comparison time identifier (differences after this). Can be zero.
Returns: The part differences data.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.SetDifferenceAccepted(System.Collections.Generic.IEnumerable{Tekla.Structures.Identifier},Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum,System.Int32,System.Boolean)
Set difference acceptance to the latest change management data.
partIds: The physical part identifiers.
type: The difference type.
positionIndex: The difference position index.
accepted: True if set as accepted, false if set as not accepted.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.IsDifferenceAccepted(Tekla.Structures.Identifier,Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum,System.Int32)
Check if difference is accepted in the latest change management data.
partId: The physical part identifier.
type: The difference type.
positionIndex: The difference position index.
Returns: True if difference is accepted in the latest change management data.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.SynchToAnalysis(System.Collections.Generic.IEnumerable{Tekla.Structures.Identifier},Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum)
Synchronize difference from physical to analysis.
Note: Position differences cannot by synchronized (but rotation can be).
partIds: The physical part identifiers.
type: The difference type.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ResetAnalysisParts(System.Collections.Generic.IEnumerable{Tekla.Structures.Identifier},Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartResetModeEnum,System.Boolean)
Reset analysis parts according to current physical part.
partIds: The physical part identifiers.
resetMode: The reset mode.
automation: True if positioning automation is enabled.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ResetAnalysisMod(System.Collections.Generic.IEnumerable{Tekla.Structures.Identifier})
Update part timestamp to suppress all the existing differences before current time.
partIds: The part identifiers.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.SynchToPhysical(System.Collections.Generic.IEnumerable{Tekla.Structures.Identifier},Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum,System.Int32)
Synchronize difference from analysis to physical.
partIds: The physical part identifiers.
type: The difference type.
positionIndex: The difference position index.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.AddPartsToPhysical(System.Collections.Generic.IEnumerable{Tekla.Structures.Analysis.AnalysisPart})
Add parts to physical (part which exists only in analysis model).
analysisParts: The analysis parts.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.GetEnabled
Get change management enabled or disabled for the analysis model.
Returns: True if change management is enabled.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.SetEnabled(System.Boolean)
Set change management enabled or disabled for the analysis model.
enabled: True if enabled.